เว็บทำงานอย่างไร

| Browser | โปรแกรมเปิดและแสดงเว็บไซต์ เช่น Chrome  
| Client | อุปกรณ์หรือโปรแกรมที่ส่งคำขอ  
| Server | เครื่องมือหรือโปรแกรมที่เก็บและส่งข้อมูลเว็บไซต์
| URL | ที่อยู่ของข้อมูลหรือหน้าเว็บไซต์  
| DNS | ระบบแปลงชื่อเว็บไซต์เป็นหมายเลข IP  
| HTTP/HTTPS | กติกาที่ Client และ Server ใช้สื่อสารกัน

Clients and servers

คอมพิวเตอร์ที่เชื่อมต่อกับอินเทอร์เน็ตเรียกว่าไคลเอนต์และเซิร์ฟเวอร์

ไคลเอนต์ คือ อุปกรณ์ที่เชื่อมต่ออินเทอร์เน็ตของผู้ใช้งานเว็บทั่วไป
(ตัวอย่างเช่น คอมพิวเตอร์ที่เชื่อมต่อกับ Wi-Fi หรือโทรศัพท์ที่เชื่อมต่อกับเครือข่ายมือถือ)
และซอฟต์แวร์ที่ใช้เข้าถึงเว็บที่มีอยู่ในอุปกรณ์เหล่านั้น (โดยปกติจะเป็นเว็บเบราว์เซอร์ เช่น Firefox หรือ Chrome)

เซิร์ฟเวอร์คือคอมพิวเตอร์ที่จัดเก็บเว็บเพจ เว็บไซต์ หรือแอปพลิเคชัน เมื่อไคลเอ็นต์ต้องการเข้าถึงเว็บเพจ
ระบบจะดาวน์โหลดสำเนาโค้ดของเว็บเพจจากเซิร์ฟเวอร์ไปยังเครื่องไคลเอ็นต์ จากนั้นเบราว์เซอร์จะแสดงผลและส่งต่อไปยังผู้ใช้

อินเทอร์เน็ตเป็นถนนสายหนึ่ง ปลายด้านหนึ่งคือลูกค้า ซึ่งเปรียบเสมือนบ้านของคุณ
และปลายอีกด้านหนึ่งคือเซิร์ฟเวอร์ ซึ่งเปรียบเสมือนร้านค้าที่คุณต้องการซื้อของ
เพื่อให้การรับส่งข้อมูลเป็นไปได้อย่างสะดวก เราจำเป็นต้องมีสิ่งต่อไปนี้:

-การเชื่อมต่ออินเทอร์เน็ตของคุณ : ช่วยให้คุณสามารถส่งและรับข้อมูลผ่านทางอินเทอร์เน็ต เปรียบเสมือนถนนที่เชื่อมระหว่างบ้านของคุณกับร้านค้า

-TCP/IP : โปรโตคอลควบคุมการส่งข้อมูลและโปรโตคอลอินเทอร์เน็ต (TCP/IP) เป็นโปรโตคอลการสื่อสารที่กำหนดวิธีการส่งข้อมูลผ่านทางอินเทอร์เน็ต
เปรียบเสมือนกลไกการขนส่งที่ช่วยให้คุณสั่งซื้อสินค้า ไปที่ร้านค้า และซื้อสินค้า ในตัวอย่างของเรา เปรียบเสมือนรถยนต์หรือจักรยาน

-DNS : ระบบชื่อโดเมน (DNS) เปรียบเสมือนสมุดที่อยู่สำหรับเว็บไซต์ เมื่อคุณพิมพ์ที่อยู่เว็บในเบราว์เซอร์ เบราว์เซอร์จะตรวจสอบ DNS
เพื่อค้นหาที่อยู่ IP ของเว็บไซต์ ซึ่งเป็นที่อยู่จริงที่เซิร์ฟเวอร์ตั้งอยู่ ก่อนที่จะสามารถดึงข้อมูลเว็บไซต์ได้ เบราว์เซอร์จำเป็นต้องค้นหาว่าเว็บไซต์นั้นอยู่บนเซิร์ฟเวอร์ใด
เพื่อที่จะส่งข้อความ HTTP ไปยังตำแหน่งที่ถูกต้อง เปรียบเสมือนการค้นหาที่อยู่ของร้านค้าก่อนที่คุณจะไปที่นั่น

-HTTP : Hypertext Transfer Protocol (HTTP) เป็นโปรโตคอลแอปพลิเคชันที่กำหนดภาษาสำหรับการสื่อสารระหว่างไคลเอ็นต์และเซิร์ฟเวอร์
เปรียบเสมือนภาษาที่คุณใช้สั่งซื้อสินค้า

-ไฟล์ : เว็บไซต์ประกอบด้วยไฟล์หลายประเภท ซึ่งเปรียบเสมือนสินค้าต่างๆ ที่คุณซื้อจากร้านค้า ไฟล์เหล่านี้แบ่งออกเป็นสองประเภทหลัก:

-การเขียนโค้ด : เว็บไซต์ส่วนใหญ่สร้างขึ้นจาก HTML, CSS และ JavaScript ซึ่งเป็นภาษาโปรแกรมต่างๆ ที่ใช้เขียนเว็บไซต์ โดยเบราว์เซอร์จะตีความและประกอบเข้าด้วยกันเป็นหน้าเว็บเพื่อแสดงผลให้ผู้ใช้เห็น
-สินทรัพย์ : นี่คือคำรวมที่ใช้เรียกสิ่งอื่น ๆ ทั้งหมดที่ปรากฏบนเว็บไซต์ เช่น รูปภาพ เพลง วิดีโอ เอกสาร Word และ PDF ซึ่งไม่ใช่โค้ดที่เบราว์เซอร์ใช้ในการตีความ

แล้วเกิดอะไรขึ้นกันแน่?
เมื่อคุณพิมพ์ที่อยู่เว็บ (ซึ่งในทางเทคนิคแล้วเป็นส่วนหนึ่งของURL ) ลงในแถบที่อยู่ของเบราว์เซอร์ ขั้นตอนต่อไปนี้จะเกิดขึ้น:

1.เบราว์เซอร์จะไปที่เซิร์ฟเวอร์ DNS และค้นหาที่อยู่จริงของเซิร์ฟเวอร์ที่เว็บไซต์นั้นตั้งอยู่
2.เบราว์เซอร์จะส่งข้อความคำขอ HTTP ไปยังเซิร์ฟเวอร์ เพื่อขอให้ส่งสำเนาของเว็บไซต์ไปยังไคลเอนต์ ข้อความนี้และข้อมูลอื่นๆ
3.ทั้งหมดที่ส่งระหว่างไคลเอนต์และเซิร์ฟเวอร์ จะถูกส่งผ่านการเชื่อมต่ออินเทอร์เน็ตของคุณโดยใช้โปรโตคอล TCP/IP
3.หากเซิร์ฟเวอร์อนุมัติคำขอของไคลเอ็นต์ เซิร์ฟเวอร์จะส่งข้อความ "200 OK" ไปยังไคลเอ็นต์ ซึ่งหมายความว่า "แน่นอน คุณสามารถดูเว็บไซต์นั้นได้! นี่คือเว็บไซต์" จากนั้นจะเริ่มส่งไฟล์ของเว็บไซต์ไปยังเบราว์เซอร์ในรูปแบบของข้อมูลชิ้นเล็กๆ ที่เรียกว่าแพ็กเก็ต
4.เบราว์เซอร์จะประกอบข้อมูลส่วนเล็กๆ เหล่านั้นเข้าด้วยกันเป็นหน้าเว็บที่สมบูรณ์และแสดงผลให้คุณเห็น

คำอธิบายเกี่ยวกับ DNS
ที่อยู่เว็บจริง ( URL ) ไม่ใช่สตริงที่จำง่ายที่คุณพิมพ์ลงในแถบที่อยู่เพื่อค้นหาเว็บไซต์โปรดของคุณ แต่เป็นตัวเลขพิเศษที่มีลักษณะเช่นนี้: 192.0.2.172<URL>

นี่เรียกว่าที่อยู่ IPซึ่งแสดงถึงตำแหน่งที่ไม่ซ้ำกันบนเว็บ อย่างไรก็ตาม การจำที่อยู่ IP นั้นไม่ใช่เรื่องง่ายใช่ไหมครับ นั่นเป็นเหตุผลที่ระบบชื่อโดเมน (DNS) ถูกคิดค้นขึ้น ระบบนี้ใช้เซิร์ฟเวอร์พิเศษที่จับคู่ที่อยู่เว็บที่คุณพิมพ์ลงในเบราว์เซอร์ (เช่น <URL> mozilla.org) กับที่อยู่ IP จริงของเว็บไซต์ เว็บไซต์ขนาดใหญ่มักจะให้บริการบนเซิร์ฟเวอร์หลายเครื่อง เพื่อให้โหลดได้อย่างมีประสิทธิภาพสำหรับผู้ใช้ที่แตกต่างกันทั่วโลก ดังนั้น ที่อยู่ IP อาจแตกต่างกันไปขึ้นอยู่กับว่าคุณอยู่ที่ไหน

คำอธิบายเกี่ยวกับแพ็กเก็ต(packets)
ก่อนหน้านี้ เราใช้คำว่า "แพ็กเก็ต" เพื่ออธิบายรูปแบบการถ่ายโอนข้อมูลระหว่างไคลเอ็นต์และเซิร์ฟเวอร์ ในที่นี้เราหมายถึงอะไร?

เมื่อส่งข้อมูลผ่านเว็บ ข้อมูลจะถูกส่งเป็นส่วนเล็กๆ หลายส่วนเรียกว่าแพ็กเก็ต แต่ละแพ็กเก็ตประกอบด้วย:

ส่วนหัวซึ่งประกอบด้วยรายละเอียดต่างๆ เช่น ที่อยู่ IP ของเซิร์ฟเวอร์และไคลเอ็นต์ หมายเลขแพ็กเก็ต จำนวนแพ็กเก็ตทั้งหมดในการส่ง และรายละเอียดของโปรโตคอลที่ใช้ในการส่ง
เพย์โหลดคือส่วนที่บรรจุข้อมูลจริงที่ส่งไปในแพ็กเก็ต
มีหลายเหตุผลที่ทำให้ข้อมูลถูกส่งเป็นแพ็กเก็ตขนาดเล็ก แต่เหตุผลที่สำคัญที่สุดคือ:

บางครั้งไฟล์อาจสูญหายหรือเสียหาย และเมื่อเกิดเหตุการณ์เช่นนี้ การที่ไคลเอนต์ร้องขอเฉพาะแพ็กเก็ตที่หายไปจะรวดเร็วและง่ายกว่าการร้องขอไฟล์ทั้งหมด
สามารถกำหนดเส้นทางการส่งแพ็กเก็ตไปตามเส้นทางต่างๆ ได้ ทำให้การส่งข้อมูลมีประสิทธิภาพสูงสุดและลดโอกาสที่เครือข่ายจะช้าลง โดยเฉพาะอย่างยิ่งเมื่อมีผู้ใช้จำนวนมากร้องขอทรัพยากรเดียวกันพร้อมกัน แพ็กเก็ตอาจมาถึงไม่เรียงลำดับ แต่ไคลเอ็นต์สามารถใช้ข้อมูลในส่วนหัวของแพ็กเก็ตเพื่อให้แน่ใจว่าแพ็กเก็ตเหล่านั้นถูกประกอบเข้าด้วยกันในลำดับที่ถูกต้อง

พื้นฐานของ HTTP
HTTP ใช้ภาษาที่เรียบง่ายของคำกริยาในการดำเนินการต่างๆ เช่น การส่งคำขอ เมธอด HTTP GETคือเมธอดที่ใช้โดยทั่วไปในการส่งคำขอ HTTP ประเภทต่างๆ ที่อธิบายไว้ข้างต้น ตัวอย่างเช่น คำขอสำหรับหน้าแรกของ MDN อาจมีลักษณะดังนี้:
GET /en-US/ HTTP/2

Host: developer.mozilla.org

ข้อความตอบกลับจากเซิร์ฟเวอร์อาจมีลักษณะดังนี้:
HTTP/2 200

date: Tue, 11 Feb 2025 11:13:30 GMT
expires: Tue, 11 Feb 2025 11:40:01 GMT
server: Google frontend
last-modified: Tue, 11 Feb 2025 00:49:32 GMT
ETag: "65f26b7f6463e2347f4e5a7a2adcee54"
content-length: 45227
content-type: text/html

<!doctype html> ... (the 45227 bytes of the requested web page HTML)

HTTP/2 200
เวอร์ชันของ HTTP ที่เซิร์ฟเวอร์ใช้ในการส่งการตอบกลับ ในกรณีนี้คือ HTTP/2 ตามด้วยรหัสสถานะที่ระบุว่าคำขอสำเร็จหรือไม่200แสดงว่าสำเร็จ

dateฯลฯexpires​
ส่วนหัวของ HTTPประกอบด้วยข้อมูลเพิ่มเติมเกี่ยวกับการตอบสนอง (โปรดทราบว่าคำขอสามารถมีส่วนหัวได้เช่นกัน) ซึ่งให้ข้อมูลเพิ่มเติมและ/หรือปรับเปลี่ยนพฤติกรรมของคำขอ

<!doctype html>เป็นต้น

301
ทรัพยากรที่ร้องขอได้ถูกย้ายไปยังตำแหน่งใหม่ถาวรแล้ว ซึ่งระบุไว้ในคำตอบ ตำแหน่งนี้ใช้สำหรับการเปลี่ยนเส้นทางเนื้อหาเมื่อมีการย้าย

400
เซิร์ฟเวอร์ไม่สามารถประมวลผลคำขอได้ โดยปกติแล้วจะเกิดขึ้นเมื่อคำขอไม่ได้อยู่ในรูปแบบที่เซิร์ฟเวอร์เข้าใจ หรือมีข้อผิดพลาดในคำขอ

403
เซิร์ฟเวอร์จะไม่ให้สิทธิ์การเข้าถึงทรัพยากรที่ร้องขอแก่ไคลเอ็นต์ โดยปกติแล้วจะเกิดขึ้นเมื่อเซิร์ฟเวอร์ทราบว่าไคลเอ็นต์เป็นใคร แต่ไม่มีสิทธิ์ในการเข้าถึงหน้าเว็บที่ร้องขอ

404
เซิร์ฟเวอร์ไม่พบทรัพยากรที่ร้องขอ สถานะนี้มักปรากฏขึ้นหาก URL ไม่ถูกต้อง หรือหากเนื้อหาถูกลบโดยไม่ได้ตั้งค่าการเปลี่ยนเส้นทาง (redirect) ไว้ก่อน

503
ไม่สามารถดำเนินการตามคำขอได้เนื่องจากมีปัญหาเกี่ยวกับเซิร์ฟเวอร์ นี่เป็นเรื่องปกติเมื่อเซิร์ฟเวอร์ปิดปรับปรุง และคาดว่าจะเป็นเพียงชั่วคราว

ส่วนประกอบของ URL
ในทางเทคนิคแล้ว ที่อยู่เว็บที่คุณพิมพ์ลงในแถบที่อยู่ของเบราว์เซอร์นั้นเป็นส่วนหนึ่งของUniform Resource Locator ( URL ) URL กำหนดตำแหน่งของทรัพยากรที่ไม่ซ้ำกันบนอินเทอร์เน็ต

URL คือที่อยู่เว็บพร้อมด้วยโปรโตคอล ตัวอย่างเช่น หากคุณเปิดแท็บใหม่ในเบราdeveloper.mozilla.orgว์เซอร์ พิมพ์ ลงในแถบที่อยู่ แล้วกดEnter/ Returnคุณจะถูกนำไปยัง URL ที่มีลักษณะดังต่อไปนี้:

https://developer.mozilla.org/en-US/
ส่วนประกอบหลักของ URL ได้แก่:

https
โปรโตคอลที่ใช้ในการส่งคำขอ ในกรณีนี้ เราใช้HTTPS ซึ่งเป็นเวอร์ชัน ที่ปลอดภัยของ HTTP ที่ป้องกันไม่ให้ผู้ไม่ประสงค์ดีอ่านข้อมูลของคุณในระหว่างการส่ง ในเว็บสมัยใหม่ เซิร์ฟเวอร์เกือบทุกเครื่องใช้ HTTPS ดังนั้นหากคุณไม่ได้ระบุไว้โดยชัดเจน เบราว์เซอร์จะถือว่าคุณใช้ HTTPS และเพิ่มให้โดยอัตโนมัติ

developer.mozilla.org
ชื่อโดเมนของ URL คือตำแหน่งระดับบนสุดของเซิร์ฟเวอร์ที่คุณกำลังเชื่อมต่อ ในกรณีนี้ ที่อยู่เว็บที่คุณพิมพ์จะเท่ากับชื่อโดเมน แต่ก็ไม่เสมอไป คุณอาจเลือกพิมพ์ที่อยู่เว็บที่ซับซ้อนกว่านี้ก็ได้ โปรดทราบว่าส่วนนี้developerเป็นซับโดเมน (พื้นที่เนื้อหาที่แตกต่างกัน) ของmozilla.orgโดเมนของ Mozilla นอกจากนี้ยังมีซับโดเมนอื่นๆ บนเว็บไซต์ของ Mozilla ที่มีเนื้อหาที่แตกต่างกัน เช่นsupport.mozilla.orgและbugzilla.mozilla.orgเป็นต้น

/en-US/
เส้นทาง ไป ยังทรัพยากรบนเซิร์ฟเวอร์ที่คุณกำลังเข้าถึง MDN เก็บเนื้อหาภาษาอังกฤษแบบอเมริกันทั้งหมดไว้ในโฟลเดอร์ชื่อen-USซึ่งเป็นสิ่งที่ URL นี้ชี้ไป

หากคุณตั้งค่าเบราว์เซอร์ให้แสดงเนื้อหาเป็นภาษาอังกฤษเป็นค่าเริ่มต้น คุณจะถูกนำไปยัง URL นี้เมื่อพิมพ์developer.mozilla.orgหากคุณตั้งค่าเบราว์เซอร์ให้แสดงเนื้อหาเป็นภาษาอื่นที่ MDN รองรับ เช่น ภาษาฝรั่งเศส คุณจะถูกนำไปยัง URL อื่น เช่นhttps://developer.mozilla.org/fr/แทน ฟังก์ชันนี้ไม่ได้มีให้ใช้งานในทุกเว็บไซต์โดยค่าเริ่มต้น นักพัฒนา MDN ได้ตั้งค่า MDN ไว้เช่นนี้เพื่อให้ผู้ใช้สามารถเข้าถึงภาษาที่ต้องการได้อย่างง่ายดาย

เเหล่งอ้างอิง
https://developer.mozilla.org/en-US/docs/Learn_web_development/Getting_started/Web_standards/How_the_web_works?utm_source=chatgpt.com
